Autodesk.Revit.DB.Analysis.FlowTransitionCharacteristic
The flow transition characteristic of the analytical segment.
Since:
2026
Since:
2026

Autodesk.Revit.DB.Analysis.FlowTransitionCharacteristic.Contraction
The segment profile is contracting along the flow direction.

Autodesk.Revit.DB.Analysis.FlowTransitionCharacteristic.Expansion
The segment profile is expanding along the flow direction.

Autodesk.Revit.DB.Analysis.FlowTransitionCharacteristic.Undefined
The flow transition characteristic is undefined.